;======== приклад процедури(функції) розрахунку факторіала числа
(define (factorial n)
  (define (fac-times n acc)
    (if (= n 0)
        acc
        (fac-times (- n 1) (* acc n))))
  (if (< n 0)
      (display "Невірний параметр!")
      (fac-times n 1)))
;--------виклик процедури(функції)---------------
(display "розрахунок факторіала\n")
(factorial 5)
(newline)
;(factorial 10000)  ; переповнення стеку не відбувається

;=====================================
;  приклад розрахунок корня квадратного за методом Ньютона
;==================================
; процедура розрахунку корня квадратного з х
(define (mysqrt x)
     (sqrt-iter 1.0 x)) ;завдання початкового значення корня з х

; рекурсивне покращення поточного значення y корня з х
(define (sqrt-iter y x)
      (if (good-enough y x);якщо досягнуто задовільне значення
          y                ; отримати значення корня 
            (sqrt-iter (improve y x) x))); інакше повторити процедуру 
; перевірка досягнення прийнятного результату обчислення кореня 
(define (good-enough y x)
        (< (abs (- (square y) x)) 0.001)); перевірка результату на точність
;квадрат числа х
(define (square x)
     (* x x))
;покращення наближення обчислення кореня з числа х
(define (improve y x)
      (average y (/ x y)))
; середнє арифметичне значення кореня та числа, з якого береться корінь
(define (average x y)
    (/ (+ x y) 2))

;--------виклик процедури(функції)---------------
(display "розрахунок корня квадратного методом Ньютона\n")
(sqrt 9) ;виклик вбудованої процедури 
(mysqrt 9);виклик написаної користувачем процедури