;====== програмування виразів============
; comment - комментарій
; + - * / називаються процедурами

(+ 2 5) ; вираз для додавання двох значень
(* 3 4 5) ; множення

(define a 3) ;форма зв'язування імені зі значенням
(+ a(* 3 2)) ;вмраз із вкладеними процедурами
;================================================================
;================= Ex1/ приклад розрахунку виразу=================
;===============================================================
; X = (AsinB+BcosA)/(1-sinC*|B+D|)
; запис виразу імперативними мовами X=(A*sin(B)+B*cos(A))/(1-sin(C)*(|B+D|))
(define A 1)
(define B -12)
(define C 3)
(define D 4)
(/ (+ (* A (sin B))
      (* B (cos A))
      (- 1 (* (sin C)
              (abs (+ B D))))
      )