  #lang racket
;=====================================
;  Ex2  розрахунок корня квадратного за методом Ньютона
;==================================
; процедура розрахунку корня квадратного з х
(define (mysqrt x)
     (sqrt-iter 1.0 x)) ;завдання початкового значення корня з х

; рекурсивне покращення поточного значення y корня з х
(define (sqrt-iter y x)
      (if (good-enough y x);якщо досягнуто задовільне значення
          y                ; отримати значення корня 
            (sqrt-iter (improve y x) x))); інакше повторити процедуру 
; перевірка досягнення прийнятного результату обчислення кореня 
(define (good-enough y x)
        (< (abs (- (square y) x)) 0.001)); перевірка результату на точність
;квадрат числа х
(define (square x)
     (* x x))
;покращення наближення обчислення кореня з числа х
(define (improve y x)
      (average y (/ x y)))
; середнє арифметичне значення кореня та числа, з якого береться корінь
(define (average x y)
    (/ (+ x y) 2))

;--------виклик процедури(функції)---------------
(display "розрахунок корня квадратного методом Ньютона\n")
(display "sqrt(9)=")
(sqrt 9) ;виклик вбудованої (пелементарної) процедури
(display "mysqrt(9)=")
(mysqrt 9);виклик написаної користувачем процедури