;==========================================
;example 67 for lab3 
;===========================================
;УМОВА задачі : пошук кореня рівняння sinx=0 методом половинного ділення
;процедура пошуку серединної точки, що претендує на значення кореня
; f  - функція, кореня якої погтрібно визначити,
; neg-point, pos-point - діапазони, в межах яких знаходиться корінь рівняння 
(define (search f neg-point pos-point)
     (let ((midpoint (average neg-point pos-point))) ; midpoint - серединна точка діапазону
          (if (close-enough? neg-point pos-point)    ;якщо точність досягнуто 
              midpoint                           ; тоді корень рівняння в точці midpoint
              (let ((test-value (f midpoint)))   ; інакше визначии діапазон для пошуку нового претендента на корінь
                (cond ((positive? test-value)   ; якщо значення функції в точці  midpoint додатнє
                           (search f neg-point midpoint)) ;шукати корінь на відрізку зліва від серединної точки
                          ((negative? test-value)          ;інакше шукати корінь на відрізку справа від серединної точки
                           (search f midpoint pos-point))
                           (else midpoint))))))
;-------------середнє арифметичне двох чисел------------------
(define (average x y)
     (/ (+ x y) 2))
;--------------перевірка на досягнення точності-----------------
(define (close-enough? x y)
      (< (abs (- x y)) 0.001))
;--------------реалізація методу половинного ділення-------------------
; f  - досліджувана функція, a,b - ліва та права межі пошуку коренів рівняння
(define (half-interval-method f a b)
       (let ((a-value (f a))
                (b-value (f b)))
    (cond ((and (negative? a-value) (positive? b-value))
          (search f a b))
          ((and (negative? b-value) (positive? a-value))
            (search f b a))
          (else
             (error "У аргументов не різні знаки " a b)))))
;--------виклик процедур--------------------------
(display "ex67  пошук кореня рівняння sinx=0 методом половинного ділення \n")
(half-interval-method sin 2.0 4.0)     ;виклик методу користувача
(display "ex67 -перевірка достовірності результату через підстановку значення кореня в рівняння \n")
(sin (half-interval-method sin 2.0 4.0))  ;виклик стандартного метожу з підстановкрй знайденого кореня
;================================